tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "bash"
brew "bat"
brew "sqlite"
brew "bpython"
brew "cocoapods"
brew "ctags"
brew "curl"
brew "python"
brew "ffmpeg"
brew "git"
brew "go"
brew "gzip"
brew "hstr"
brew "htop"
brew "hub"
brew "less"
brew "libusbmuxd"
brew "libimobiledevice"
brew "mas"
brew "neofetch"
brew "netcat"
brew "node"
brew "openssh"
brew "perl"
brew "rsync"
brew "ruby"
brew "shc"
brew "shellcheck"
brew "shfmt"
brew "sleepwatcher"
brew "smartmontools"
brew "swiftlint"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "wget"
brew "xctool"
brew "yarn"
brew "youtube-dl"
brew "zsh"
cask "adoptopenjdk"
cask "anydesk"
cask "apparency"
cask "appcleaner"
cask "apple-juice"
cask "balenaetcher"
cask "cheatsheet"
cask "checkra1n"
cask "coconutbattery"
cask "discord"
cask "electrum"
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
cask "free-download-manager"
cask "gitter"
cask "google-chrome"
cask "hex-fiend"
cask "iina"
cask "intel-power-gadget"
cask "istat-menus"
cask "latest"
cask "liteicon"
cask "loom"
cask "mpv"
cask "numi"
cask "pacifist"
cask "plistedit-pro"
cask "popcorn-time"
cask "pycharm"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "skype"
cask "slack"
cask "soundsource"
cask "spotify"
cask "stremio"
cask "teamviewer"
cask "textmate"
cask "tunnelbear"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vmware-fusion"
cask "webtorrent"
mas "Amphetamine", id: 937984704
mas "Cinebench", id: 1438772273
mas "Disk Speed Test", id: 425264550
mas "Keynote", id: 409183694
mas "Master of Typing 3: Practice", id: 1116003635
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SHAREit", id: 1040029915
mas "Shazam", id: 897118787
mas "Xcode", id: 497799835
