tap "bootoption/repo"
tap "buo/cask-upgrade"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "krish-sysadmin/virt-manager"
tap "nrlquaker/createzap"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "sidneys/homebrew"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Fancy interface to the Python interpreter
brew "bpython"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Print information about OpenCL platforms and devices
brew "clinfo"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Classic UNIX line editor
brew "ed"
# Modern replacement for 'ls'
brew "exa"
# Database of public exploits and corresponding vulnerable software
brew "exploitdb"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Popular GNU data compression program
brew "gzip"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Network logon cracker which supports many services
brew "hydra"
# GNU utilities for networking
brew "inetutils"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# DNS library written in C
brew "ldns"
# Pager program similar to more
brew "less"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Text-based web browser
brew "lynx"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Mac App Store command-line interface
brew "mas"
# Official Monero wallet and CPU miner
brew "monero"
# Open source relational database management system
brew "mysql", restart_service: true
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php", restart_service: true
# Python dependency management tool
brew "pipenv"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Cross-platform application and UI framework
brew "qt@5", link: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Shell Script Compiler
brew "shc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Version control system designed to be a better CVS
brew "subversion"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Gather materials from public sources (for pen testers)
brew "theharvester"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Graphical network analyzer and capture tool
brew "wireshark", link: false
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# EFI boot menu manipulation for macOS
brew "bootoption/repo/bootoption"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Allows connection to a computer remotely
cask "anydesk"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Audio utility
cask "background-music"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# GUI for automatically saving SHSH blobs
cask "blobsaver"
# Monitors common persistence locations
cask "blockblock"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Jailbreak for iPhone 5s through iPhone X, iOS 12.0 and up
cask "checkra1n"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# Bitcoin thin client
cask "electrum"
# Launcher for *Epic Games* games
cask "epic-games"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Programming font
cask "font-anonymous-pro"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Version of Cascadia Code without ligatures
cask "font-cascadia-mono"
cask "font-cousine"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono-nerd-font"
# Sans-serif variant of "San Francisco" by Apple
cask "font-sf-pro"
cask "font-source-sans-pro"
# Download accelerator and organizer
cask "free-download-manager"
cask "gitter"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Hackintosh patching tool
cask "hackintool"
# Hex editor focussing on speed
cask "hex-fiend"
# Free and open-source media player
cask "iina"
# Power usage monitoring tool enabled for Intel Core processors
cask "intel-power-gadget"
# System monitoring app
cask "istat-menus"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Utility that shows the latest app updates
cask "latest"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Host-based application firewall
cask "little-snitch"
# Clipboard manager
cask "maccy"
# ACPI Machine Language (AML) compiler and IDE
cask "maciasl"
# Detailed information on every Apple product ever made
cask "mactracker"
# Utility to open, create and modify archive files
cask "maczip"
# Visual diff and merge tool
cask "meld"
# Penetration testing framework
cask "metasploit"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Untraceable cryptocurrency wallet
cask "monero-wallet"
# Securely and anonymously share files, host websites, and chat with friends
cask "onionshare"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# JDK from Oracle
cask "oracle-jdk"
# JDK from Oracle
cask "oracle-jdk17"
# Monitors computer mic and webcam
cask "oversight"
# Customize and maintain app icons
cask "pictogram"
# Property list and JSON editor
cask "plistedit-pro"
# Plist file editor
cask "plistedplus"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# VPN client focusing on security
cask "protonvpn"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Web browser focusing on security
cask "tor-browser"
# Charting and social-networking for investment traders
cask "tradingview"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Run commands and display their output on the desktop
cask "ubersicht"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Torrent streaming application
cask "webtorrent"
# Shows a files cryptographic signing information
cask "whatsyoursign"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Network protocol analyzer
cask "wireshark"
# Apache distribution containing MySQL, PHP, and Perl
cask "xampp"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Cinebench", id: 1438772273
mas "Disk Speed Test", id: 425264550
mas "Image2icon", id: 992115977
mas "OwlOCR", id: 1499181666
mas "RunCat", id: 1429033973
mas "Shazam", id: 897118787
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "AloyseTech.hex-array-formatter"
vscode "antfu.icons-carbon"
vscode "appulate.filewatcher"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bierner.markdown-preview-github-styles"
vscode "bmalehorn.shell-syntax"
vscode "cdonohue.quill-icons"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "CoenraadS.disableligatures"
vscode "dae.vscode-mac-color-picker"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EliverLara.mars"
vscode "EliverLara.sweet-vscode-icons"
vscode "fabioz.vscode-pydev"
vscode "fisheva.eva-theme"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gio00.convertplist"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "IBM.output-colorizer"
vscode "idleberg.applescript"
vscode "illixion.vscode-vibrancy-continued"
vscode "iocave.customize-ui"
vscode "iocave.monkey-patch"
vscode "JacobKucera.codepen-theme"
vscode "JacobZwang.http-status-code-index"
vscode "jtlowe.vscode-icon-theme"
vscode "Kasik96.swift"
vscode "klarefrank.codepen-nights"
vscode "lusignan.nautical-twilight"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mateuszchudyk.hexinspector"
vscode "maziac.asm-code-lens"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "mrmlnc.vscode-postcss-sorting"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "PKief.material-icon-theme"
vscode "PKief.material-product-icons"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "rastikerdar.vscode-seedling-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "Remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "rogalmic.bash-debug"
vscode "sainnhe.everforest"
vscode "sharat.vscode-brewfile"
vscode "shardulm94.trailing-spaces"
vscode "SolarLiner.linux-themes"
vscode "solnurkarim.html-to-css-autocompletion"
vscode "StevenPhan.framer-syntax"
vscode "Thog.vscode-asl"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "Tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "XadillaX.viml"
vscode "yandeu.five-server"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
vscode "zhouronghui.propertylist"
vscode "zhuangtongfa.material-theme"
