tap "bootoption/repo"
tap "buo/cask-upgrade"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "krish-sysadmin/virt-manager"
tap "nrlquaker/createzap"
tap "sidneys/homebrew"
brew "aria2"
brew "bash"
brew "bat"
brew "bpython"
brew "cabextract"
brew "cdrtools"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dos2unix"
brew "exa"
brew "libass"
brew "snappy"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "graphviz"
brew "gzip"
brew "hstr"
brew "htop"
brew "ldns"
brew "less"
brew "libusbmuxd"
brew "libimobiledevice"
brew "macchina"
brew "mas"
brew "monero"
brew "netcat"
brew "node"
brew "openssh"
brew "perl"
brew "python-tk@3.9"
brew "qt@5", link: true
brew "rename"
brew "rsync"
brew "ruby"
brew "shc"
brew "shellcheck"
brew "shfmt"
brew "sleepwatcher"
brew "smartmontools"
brew "speedtest-cli"
brew "subversion"
brew "swiftlint"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "wimlib"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "bootoption/repo/bootoption"
brew "sidneys/homebrew/chntpw"
cask "adoptopenjdk"
cask "apparency"
cask "appcleaner"
cask "balenaetcher"
cask "cheatsheet"
cask "checkra1n"
cask "cloudflare-warp"
cask "coconutbattery"
cask "discord"
cask "electrum"
cask "epic-games"
cask "font-blex-mono-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-sf-pro"
cask "free-download-manager"
cask "ghidra"
cask "gitter"
cask "grammarly"
cask "hackintool"
cask "hex-fiend"
cask "iina"
cask "intel-power-gadget"
cask "istat-menus"
cask "latest"
cask "launchcontrol"
cask "lingon-x"
cask "lulu"
cask "maccy"
cask "maciasl"
cask "mactracker"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "monero-wallet"
cask "mos"
cask "openinterminal"
cask "pictogram"
cask "plistedit-pro"
cask "plistedplus"
cask "popcorn-time"
cask "prefs-editor"
cask "pycharm"
cask "quicklook-csv"
cask "rar"
cask "rectangle"
cask "sbarex-qlmarkdown"
cask "skype"
cask "slack"
cask "soundsource"
cask "spotify"
cask "stremio"
cask "suspicious-package"
cask "syntax-highlight"
cask "teamviewer"
cask "telegram"
cask "textmate"
cask "thonny"
cask "tor-browser"
cask "tunnelbear"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "webtorrent"
mas "1Blocker", id: 1365531024
mas "Amphetamine", id: 937984704
mas "Cinebench", id: 1438772273
mas "Crypto Pro", id: 980888073
mas "Disk Speed Test", id: 425264550
mas "Image2icon", id: 992115977
mas "Keynote", id: 409183694
mas "Master of Typing 3 - Practice", id: 1116003635
mas "Numbers", id: 409203825
mas "OwlOCR", id: 1499181666
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "SHAREit", id: 1040029915
mas "Shazam", id: 897118787
mas "Xcode", id: 497799835
